tutorials/heatTransfer/chtMultiRegionFoam/heatedDuct/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform (0 0 1e-3);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    fluidInlet
    {
        type            fixedValue;
        value           uniform (0 0 1e-3);
    }
    fluidOutlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    fluid_to_metal
    {
        type            noSlip;
    }
}

// ************************************************************************* //
