tutorials/heatTransfer/chtMultiRegionFoam/heatedDuct/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-0.001 -10.001  -0.001)
    (50.001 -10.001  -0.001)
    (50.001  50.001  -0.001)
    (-0.001  50.001  -0.001)
    (-0.001 -10.001 150.001)
    (50.001 -10.001 150.001)
    (50.001  50.001 150.001)
    (-0.001  50.001 150.001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) fluid (20 24 60) simpleGrading (1 1 1)
);

edges
(
);

defaultPatch
{
    type empty;
    name default;
}

boundary
(
);

// ************************************************************************* //
