tutorials/heatTransfer/chtMultiRegionFoam/heatedDuct/system/fluid/SYMLINKS.txt
The original source for 'decomposeParDict' was '../decomposeParDict'
