tutorials/heatTransfer/chtMultiRegionFoam/heatedDuct/system/heater/SYMLINKS.txt
The original source for 'decomposeParDict' was '../decomposeParDict'
