tutorials/heatTransfer/chtMultiRegionFoam/heatedDuct/system/metal/SYMLINKS.txt
The original source for 'decomposeParDict' was '../decomposeParDict'
